# Завдання 2
#
# Створіть абстрактний клас "Фігура" з абстрактними методами для отримання площі та периметру.
# Наслідуйте від нього декілька (> 2) інших фігур, та реалізуйте математично вірні для них методи для площі та периметру.
# Властивості по типу “довжина сторони” й т.д. повинні бути приватними, та ініціалізуватись через конструктор.
# Створіть Декілька різних об’єктів фігур, та у циклі порахуйте та виведіть в консоль площу та периметр кожної.

from figures import Circle, Rectangle, Square

def main():
    figures = [
        Circle(5),
        Rectangle(4, 6),
        Square(3)
    ]

    for figure in figures:
        print(f"{figure.__class__.__name__}:")
        print(f" - Area = {figure.area()}")
        print(f" - Perimeter = {figure.perimeter():.1f}")
        print(" ")

if __name__ == "__main__":
    main()
